shoppe-api/app/controllers/api/v1/stores_controller.rb

INSERT INTO "stores" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "My Store (please delete later)"], ["created_at", "2021-05-13 15:34:41.733889"], ["updated_at", "2021-05-13 15:34:41.733889"]]
---
  def create
    @store = Store.new(store_params)

    if @store.save

UPDATE "stores" SET "name" = ?, "updated_at" = ? WHERE "stores"."id" = ?  [["name", "new!"], ["updated_at", "2021-05-13 16:33:23.420693"], ["id", 13]]
---
  def update
    if @store.update(store_params)

DELETE FROM "stores" WHERE "stores"."id" = ?  [["id", 17]]
---
  def destroy
    if @store.destroy